
'use client'
import React from 'react';
import styles from './info.module.scss';
import PolicyIcon from '../../../public/info-page/policy.svg';
import RekIcon from '../../../public/info-page/rek.svg';
import PublicIcon from '../../../public/info-page/public-off.svg';
import InfoIcon from '../../../public/info-page/info.svg';
import { Tab, Tabs, TabList, TabPanel } from 'react-tabs';
import Accordion from '@/components/Accordion/Accordion';

const page = () => {
  return (
    <div className={styles.faq}>
      <div className="container">
        <div className={styles.heading}>
            <InfoIcon className='icon' width={20} height={20}/>
            <div className={styles.title}>
                Информация
            </div>
        </div>
        <div className={styles.body}>
            <div className={styles.tabs}>
            <Tabs>
                <TabList>
                    <Tab>
                        <PolicyIcon className='icon' width={32} height={31.68}/>
                        <h2 className='header'>Политика конфидециальности</h2>
                    </Tab>
                    <Tab>
                        <PublicIcon className='icon' width={29.48} height={32}/>
                        <h2 className='header'>Публичная оферта</h2>
                    </Tab>
                    <Tab>
                        <RekIcon className='icon' width={32} height={32}/>
                        <h2 className='header'>Реквизиты</h2>
                    </Tab>
                </TabList>

                <TabPanel>
                    <div className={styles.policy}>
                        <div className={styles.policyTitle}>
                            1.Введение
                        </div>
                        <ul className={styles.list}>
                            <li className={styles.item}>
                                <div className={styles.number}>1.1</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                            <li className={styles.item}>
                                <div className={styles.number}>1.2</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                        </ul>
                        <div className={styles.policyTitle}>
                            1.Информация, которую мы собираем
                        </div>
                        <ul className={styles.list}>
                            <li className={styles.item}>
                                <div className={styles.number}>1.3</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                        </ul>
                    </div>
                </TabPanel>
                <TabPanel>
                <div className={styles.policy}>
                        <div className={styles.policyTitle}>
                            1.Введение
                        </div>
                        <ul className={styles.list}>
                            <li className={styles.item}>
                                <div className={styles.number}>1.1</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                            <li className={styles.item}>
                                <div className={styles.number}>1.2</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                        </ul>
                        <div className={styles.policyTitle}>
                            1.Информация, которую мы собираем
                        </div>
                        <ul className={styles.list}>
                            <li className={styles.item}>
                                <div className={styles.number}>1.3</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                            <li className={styles.item}>
                                <div className={styles.number}>1.4</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                            <li className={styles.item}>
                                <div className={styles.number}>1.5</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                        </ul>
                    </div>
                </TabPanel>
                <TabPanel>
                <div className={styles.policy}>
                        <div className={styles.policyTitle}>
                            1.Введение
                        </div>
                        <ul className={styles.list}>
                            <li className={styles.item}>
                                <div className={styles.number}>1.1</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                            <li className={styles.item}>
                                <div className={styles.number}>1.2</div>
                                <p className={styles.text}>Используя и / или посещая любой раздел веб-сайта; или открывая учетную запись на Сайте, вы соглашаетесь соблюдать Политику конфиденциальности. В настоящей Политике конфиденциальности описывается, как мы собираем, используем, обрабатываем и раскрываем вашу информацию, включая личную информацию, в связи с вашим доступом к этому Веб-сайту и его использованием. «Контроллер данных» - это компания, которая определяет цели и средства обработки персональных данных в соответствии с настоящей Политикой конфиденциальности. ITSFAIL LTD действует в качестве контроллера данных в соответствии с Регламентом ЕС 2016/679, определяющим цели и средства обработки ваших личных данных. При использовании платежных услуг вы также будете предоставлять свою информацию, включая личную информацию, компании ITSFAIL LTD , регистрационный номер 13246765, зарегистрированной по адресу: 16 John Nicholas Crescent, Ellesmere Port, Cheshire, United Kingdom, CH65 2DL.</p>
                            </li>
                        </ul>
                    </div>
                </TabPanel>
                <TabPanel>
                3333333333
                </TabPanel>
            </Tabs>
            </div>
        </div>
      </div>
    </div>
  )
}

export default page
